 # groupby exercise

In [2]:
import pandas as pd
import numpy as np

### import the datset drinks.csv and load it using pandas.

In [3]:
drinks = pd.read_csv('/Users/manibhattarai/Desktop/Integrigy_assignments/Pandas_assignment/assignmet_file/drinks.csv')
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [4]:
drinks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     170 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

### Which continent drinks more beer on average?

In [5]:
drinks.groupby('continent')['beer_servings'].mean()

continent
AF     61.471698
AS     37.045455
EU    193.777778
OC     89.687500
SA    175.083333
Name: beer_servings, dtype: float64

### For each continent print the statistics for wine consumption.

In [6]:
drinks.groupby('continent')['wine_servings'].describe()

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

###  Print the mean alcohol consumption per continent for every column

In [7]:
drinks.groupby('continent').mean()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,61.471698,16.339623,16.264151,3.007547
AS,37.045455,60.840909,9.068182,2.170455
EU,193.777778,132.555556,142.222222,8.617778
OC,89.687500,58.437500,35.625000,3.381250
SA,175.083333,114.750000,62.416667,6.308333

### Print the mean, min and max values for spirit consumption.

In [8]:
drinks.groupby('continent').agg(['mean','min','max'])

          beer_servings          spirit_servings          wine_servings      \
                   mean min  max            mean min  max          mean min
continent
AF            61.471698   0  376       16.339623   0  152     16.264151   0
AS            37.045455   0  247       60.840909   0  326      9.068182   0
EU           193.777778   0  361      132.555556   0  373    142.222222   0
OC            89.687500   0  306       58.437500   0  254     35.625000   0
SA           175.083333  93  333      114.750000  25  302     62.416667   1

               total_litres_of_pure_alcohol
           max                         mean  min   max
continent
AF         233                     3.007547  0.0   9.1
AS         123                     2.170455  0.0  11.5
EU         370                     8.617778  0.0  14.4
OC         212                     3.381250  0.0  10.4
SA         221                     6.308333  3.8   8.3

# load a new data file u.user and read it

In [9]:
user = pd.read_csv('/Users/manibhattarai/Desktop/Integrigy_assignments/Pandas_assignment/assignmet_file/u.user',sep='|')
user.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [10]:
user.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

### Discover what is the mean age per occupation

In [11]:
user.groupby('occupation')['age'].mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

### Discover the Male ratio per occupation and sort it from the most to the least

In [23]:
new_table = pd.pivot_table(user,index='occupation',columns='gender',aggfunc='size')
new_table['total'] = new_table['M'] + new_table['F'] 
new_table['male_ratio'] = (new_table['M']/new_table['total'])*100
new_table.dropna()
new_table.sort_values(by=['male_ratio'],ascending=False)

gender            F      M  total  male_ratio
occupation
engineer        2.0   65.0   67.0   97.014925
technician      1.0   26.0   27.0   96.296296
retired         1.0   13.0   14.0   92.857143
programmer      6.0   60.0   66.0   90.909091
executive       3.0   29.0   32.0   90.625000
scientist       3.0   28.0   31.0   90.322581
entertainment   2.0   16.0   18.0   88.888889
lawyer          2.0   10.0   12.0   83.333333
salesman        3.0    9.0   12.0   75.000000
educator       26.0   69.0   95.0   72.631579
student        60.0  136.0  196.0   69.387755
other          36.0   69.0  105.0   65.714286
marketing      10.0   16.0   26.0   61.538462
writer         19.0   26.0   45.0   57.777778
none            4.0    5.0    9.0   55.555556
administrator  36.0   43.0   79.0   54.430380
artist         13.0   15.0   28.0   53.571429
librarian      29.0   22.0   51.0   43.137255
healthcare     11.0    5.0   16.0   31.250000
homemaker       6.0    1.0    7.0   14.285714
doctor          NaN    7.0    NaN         NaN

In [ ]:
male_ratio =(gender_count/total_count)*100
male_ratio.sort_values('gender',ascending=False)

#### For each occupation, calculate the minimum and maximum ages

In [ ]:
user.groupby('occupation').agg(['min','max'])

 ### For each combination of occupation and gender, calculate the mean age without heirarchical indexing

In [ ]:
user.groupby(['occupation','gender'])['age'].mean()

### For each occupation present the percentage of women and men

In [ ]:
gender_count=user.groupby(['occupation','gender'])['gender'].count()
total_count = user.groupby('occupation')['gender'].count()
female_male_ratio =(gender_count/total_count)*100
female_male_ratio

### Iterate over a group and print the name and the whole data from the occupations

In [24]:
user.occupation

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object